Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  if (reqSSID.length() > 0) {
    saveSettings(reqSSID, reqPass, newBright, reqAutoDim);
    setOledBrightness(newBright);

    String html = "<html><body style='background:#121212;color:#eee;text-align:center;padding:40px;font-family:Arial;'>";
    html += "<h2>Settings Saved!</h2><p>Brightness: " + String(newBright) + "</p>";
    html += "<p>Auto-dim: " + String(reqAutoDim ? "Enabled" : "Disabled") + "</p><p>Rebooting...</p></body></html>";
    server.send(200, "text/html", html);
    delay(1500);
    ESP.restart();
  } else {
    server.send(400, "text/plain", "SSID cannot be empty.");
  }
}

void configureMode(DeviceMode newMode) {
  currentMode = newMode;
  display.clearDisplay();

  setOledBrightness(userBrightness);

  server.stop();
  wifi_promiscuous_enable(0);
  irrecv.disableIRIn();
  shutoffLeds();
  alertLedActive = false;

  switch (currentMode) {
    case MODE_RADAR:
      WiFi.persistent(false);
      WiFi.disconnect();
      WiFi.mode(WIFI_STA);
      wifi_set_opmode(STATION_MODE);
      wifi_promiscuous_enable(0);
      wifi_set_promiscuous_rx_cb(snifferCallback);
      wifi_promiscuous_enable(1);
      break;

    case MODE_SCANNER:
      WiFi.mode(WIFI_STA);
      WiFi.disconnect();
      totalNetworksFound = 0;
      triggerWifiScan();
      lastScanTime = millis();
      break;

    case MODE_RF_TRIPWIRE:
      WiFi.mode(WIFI_STA);
      WiFi.setSleepMode(WIFI_NONE_SLEEP);
      WiFi.begin(target_ssid, target_password);
      baselineInitialized = false;
      isCalibrating = false;
      calibrationStartTime = 0;
      maxNoiseObserved = 0.0;
      for (int i = 0; i < WAVE_POINTS; i++) waveBuffer[i] = 42;
      break;

    case MODE_IR_DECODER:
      WiFi.disconnect();
      WiFi.mode(WIFI_OFF);
      irrecv.setUnknownThreshold(12);
      irrecv.enableIRIn();
      break;

    case MODE_AP_CONFIG: {
      WiFi.persistent(false);
      WiFi.disconnect(true);
      delay(50);
      WiFi.mode(WIFI_AP_STA);

      IPAddress local_ip(192, 168, 4, 1);
      IPAddress gateway(192, 168, 4, 1);
      IPAddress subnet(255, 255, 255, 0);
      WiFi.softAPConfig(local_ip, gateway, subnet);
      WiFi.softAP(AP_CONFIG_SSID, AP_CONFIG_PASS, 1, 0, 4);

      server.begin();
      break;
    }
  }
}

void enterLockScreen() {
  isDeviceLocked = true;
  isClockModeActive = false;
  resumeMode = currentMode;

  shutoffLeds();
  alertLedActive = false;

  if (autoDimEnabled) {
    uint8_t dimLevel = map(userBrightness, 1, 255, 1, 35);
    setOledBrightness(dimLevel);
  } else {
    setOledBrightness(userBrightness);
  }

  if (isNightWindow()) {
    currentEmotion = EMO_SLEEP;
  } else if (isMorningWindow()) {
    setEmotion(EMO_GOOD_MORNING);
  } else {
    currentEmotion = EMO_NORMAL;
  }

  display.clearDisplay();
  display.display();
}

void unlockDevice() {
  isDeviceLocked = false;
  lastUserActivity = millis();

  setOledBrightness(userBrightness);

  display.clearDisplay();
  configureMode(resumeMode);
}

// Advanced Smooth EMO Renderer with LERP Interpolation
void drawEmoFace() {
  unsigned long now = millis();

  if (currentEmotion != EMO_NORMAL && currentEmotion != EMO_SLEEP && currentEmotion != EMO_DIZZY) {
    if (now - emotionHoldStartTime > EMOTION_HOLD_MS) {
      currentEmotion = isNightWindow() ? EMO_SLEEP : EMO_NORMAL;
    }
  } else if (currentEmotion == EMO_DIZZY) {
    if (now - emotionHoldStartTime > 2500) {
      currentEmotion = isNightWindow() ? EMO_SLEEP : EMO_NORMAL;
    }
  } else {
    if (isNightWindow()) {
      currentEmotion = EMO_SLEEP;
    }
  }

  display.clearDisplay();

  const int eyeW = 28;
  const int leftEyeBaseX = 26;
  const int rightEyeBaseX = 74;
  const int eyeBaseY = 17;

  // 1. DIZZY STATE (Smooth rotating spirals)
  if (currentEmotion == EMO_DIZZY) {
    dizzyAngle += 0.35;
    int lx = leftEyeBaseX + 14;
    int rx = rightEyeBaseX + 14;
    int cy = eyeBaseY + 15;

    for (int r = 4; r <= 16; r += 4) {
      display.drawCircle(lx, cy, r, SSD1306_WHITE);
      display.drawCircle(rx, cy, r, SSD1306_WHITE);
    }
    // Rotating crosshairs to simulate spiraling eyes
    display.drawLine(lx + cos(dizzyAngle) * 16, cy + sin(dizzyAngle) * 16, lx - cos(dizzyAngle) * 16, cy - sin(dizzyAngle) * 16, SSD1306_WHITE);
    display.drawLine(rx + cos(dizzyAngle) * 16, cy + sin(dizzyAngle) * 16, rx - cos(dizzyAngle) * 16, cy - sin(dizzyAngle) * 16, SSD1306_WHITE);

    display.display();
    return;
  }

  // 2. GOOD MORNING STATE
  if (currentEmotion == EMO_GOOD_MORNING) {
    display.fillRoundRect(leftEyeBaseX, eyeBaseY + 2, eyeW, 26, 8, SSD1306_WHITE);
    display.fillRoundRect(rightEyeBaseX, eyeBaseY + 2, eyeW, 26, 8, SSD1306_WHITE);
    display.fillRect(leftEyeBaseX, eyeBaseY + 16, eyeW, 14, SSD1306_BLACK);
    display.fillRect(rightEyeBaseX, eyeBaseY + 16, eyeW, 14, SSD1306_BLACK);

    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setCursor(22, 50);
    display.print("GOOD MORNING!");

    display.display();
    return;
  }

  // 3. SLEEPING STATE
  if (currentEmotion == EMO_SLEEP) {
    display.fillRect(leftEyeBaseX, eyeBaseY + 14, eyeW, 3, SSD1306_WHITE);
    display.fillRect(rightEyeBaseX, eyeBaseY + 14, eyeW, 3, SSD1306_WHITE);

    if (now - lastZzzAnim > 350) {
      lastZzzAnim = now;
      zzzStep = (zzzStep + 1) % 4;
    }
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    if (zzzStep >= 1) { display.setCursor(98, 24); display.print("z"); }
    if (zzzStep >= 2) { display.setCursor(106, 15); display.print("Z"); }
    if (zzzStep >= 3) { display.setCursor(114, 6);  display.print("Z"); }

    display.display();
    return;
  }

  // 4. SHOCKED STATE
  if (currentEmotion == EMO_SHOCKED) {
    display.fillCircle(leftEyeBaseX + 14, eyeBaseY + 15, 17, SSD1306_WHITE);
    display.fillCircle(rightEyeBaseX + 14, eyeBaseY + 15, 17, SSD1306_WHITE);
    display.fillCircle(leftEyeBaseX + 14, eyeBaseY + 15, 5, SSD1306_BLACK);
    display.fillCircle(rightEyeBaseX + 14, eyeBaseY + 15, 5, SSD1306_BLACK);

