Debjit230/ESP8266-EXPERIMENT/src/main.cpp
  display.display();
}

void drawTripwireUI(float delta, int currentRssi, bool motionAlert) {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.printf("TRIPWIRE: %2ddBm", currentRssi);
  display.drawLine(0, 9, 127, 9, SSD1306_WHITE);

  if (motionAlert) {
    display.fillRect(0, 11, 128, 10, SSD1306_WHITE);
    display.setTextColor(SSD1306_BLACK);
    display.setCursor(18, 12);
    display.print("** MOTION ALERT **");
    display.setTextColor(SSD1306_WHITE);
  } else {
    display.setCursor(0, 12);
    display.printf("D:%.1f TH:%.1f", delta, dynamicThreshold);
  }

  display.drawFastHLine(0, 42, 128, SSD1306_WHITE);

  for (int x = 0; x < WAVE_POINTS - 1; x++) {
    int idx1 = (waveIndex + x) % WAVE_POINTS;
    int idx2 = (waveIndex + x + 1) % WAVE_POINTS;
    display.drawLine(x, waveBuffer[idx1], x + 1, waveBuffer[idx2], SSD1306_WHITE);
  }

  display.display();
}

void drawDecoderUI() {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);

  display.setCursor(0, 0);
  display.println("--- IR DECODER ---");

  display.setCursor(0, 16);
  display.print("Proto: ");
  display.println(lastProtocol);

  display.setCursor(0, 28);
  display.print("Code : ");
  display.println(lastHexCode);

  display.setCursor(0, 40);
  display.printf("Bits : %d-bit\n", lastBits);

  display.setCursor(0, 54);
  display.print("TSOP Receiver: Ready");

  display.display();
}

void syncTimeAtStartup() {
  display.clearDisplay();
  display.setTextColor(SSD1306_WHITE);
  display.setTextSize(1);
  display.setCursor(0, 10);
  display.println("CONNECTING AP...");
  display.setCursor(0, 26);
  display.println(target_ssid[0] ? target_ssid : "[NO AP STORED]");
  display.setCursor(0, 44);
  display.println("Hold D5: Setup AP");
  display.display();

  if (!target_ssid[0]) return;

  WiFi.mode(WIFI_STA);
  WiFi.begin(target_ssid, target_password);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 8000) {
    delay(100);
    if (digitalRead(BUTTON_PIN) == LOW) {
      configureMode(MODE_AP_CONFIG);
      return;
    }
  }

  if (WiFi.status() == WL_CONNECTED) {
    display.clearDisplay();
    display.setCursor(0, 18);
    display.println("Wi-Fi Connected!");
    display.setCursor(0, 34);
    display.println("Syncing NTP Time...");
    display.display();

    configTime(gmtOffset_sec, daylightOffset_sec, ntpServer);

    time_t now = time(nullptr);
    start = millis();
    while (now < 100000 && millis() - start < 4000) {
      delay(200);
      now = time(nullptr);
    }
  }
}

void setup() {
  pinMode(EXTERNAL_LED, OUTPUT);
  pinMode(BOARD_LED, OUTPUT);
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  pinMode(IR_RECV_PIN, INPUT_PULLUP);

  shutoffLeds();

  Serial.begin(115200);
  delay(100);

  loadCredentials();

  server.on("/", handleRoot);
  server.on("/save", HTTP_POST, handleConfigSave);

  // Initialize OLED with SCL on D4 and SDA on D3
  Wire.begin(OLED_SDA, OLED_SCL);
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  display.setRotation(2);
  display.clearDisplay();
  display.display();

  setOledBrightness(userBrightness);

  syncTimeAtStartup();

  lastUserActivity = millis();

  if (isMorningWindow()) {
    enterLockScreen();
    setEmotion(EMO_GOOD_MORNING);
  } else if (currentMode != MODE_AP_CONFIG) {
    configureMode(MODE_RADAR);
  }
}

void loop() {
  unsigned long currentMillis = millis();

  // 1. Alert Pulse Auto-Shutoff (120ms)
  if (alertLedActive && (currentMillis - alertLedStart >= LED_ALERT_DURATION)) {
    alertLedActive = false;
    shutoffLeds();
  }

  // 2. Button Engine (Single-Click, Fast Double-Click, Triple-Click, and 2-Second Hold)
  if (currentMillis - lastButtonCheck >= 25) {
    lastButtonCheck = currentMillis;
    bool pinState = (digitalRead(BUTTON_PIN) == LOW);

    if (pinState && !buttonIsPressed) {
      buttonIsPressed = true;
      buttonPressStartTime = currentMillis;
      holdThresholdMet = false;
    } 
    else if (pinState && buttonIsPressed) {
      unsigned long heldTime = currentMillis - buttonPressStartTime;

      if (!isDeviceLocked && !holdThresholdMet) {
        if (heldTime >= 2000) {
          holdThresholdMet = true;
          clickCount = 0;
          lastUserActivity = currentMillis;
          isClockModeActive = false;
          configureMode(MODE_AP_CONFIG);
        } else if (heldTime >= 400) {
          display.fillRect(10, 56, (heldTime - 400) * 108 / 1600, 4, SSD1306_WHITE);
          display.display();
        }
      }
    } 
    else if (!pinState && buttonIsPressed) {
      buttonIsPressed = false;
      unsigned long duration = currentMillis - buttonPressStartTime;

      if (duration < 600 && !holdThresholdMet) {
        clickCount++;
        lastClickTime = currentMillis;

        if (clickCount == 2) {
          // Double click triggers lock / unlock
          clickCount = 0;
          if (isDeviceLocked) {
            unlockDevice();
          } else {
            enterLockScreen();
          }
        } else if (clickCount >= 3) {
          // Rapid triple click triggers dizzy reaction!
          clickCount = 0;
          if (isDeviceLocked) {
            setEmotion(EMO_DIZZY);
          }
        }
      }
    }

    if (clickCount == 1 && (currentMillis - lastClickTime > DOUBLE_CLICK_GAP)) {
      clickCount = 0;
      if (!isDeviceLocked) {
        lastUserActivity = currentMillis;

        if (isClockModeActive) {
          isClockModeActive = false;
          setOledBrightness(userBrightness);
          display.clearDisplay();
        } else {
          DeviceMode nextMode;
          if (currentMode == MODE_RADAR)             nextMode = MODE_SCANNER;
          else if (currentMode == MODE_SCANNER)     nextMode = MODE_RF_TRIPWIRE;
          else if (currentMode == MODE_RF_TRIPWIRE) nextMode = MODE_IR_DECODER;
          else                                      nextMode = MODE_RADAR;

          configureMode(nextMode);
        }
      }
    }
  }

  // 3. Automated Locks and Screen Savers
  if (!isDeviceLocked && currentMode != MODE_AP_CONFIG) {
    if (currentMillis - lastUserActivity >= AUTO_LOCK_MS) {
      enterLockScreen();
    } else if (!isClockModeActive && (currentMillis - lastUserActivity >= CLOCK_TIMEOUT_MS)) {
      isClockModeActive = true;
      if (autoDimEnabled) {
        uint8_t dimLevel = map(userBrightness, 1, 255, 1, 35);
        setOledBrightness(dimLevel);
      } else {
        setOledBrightness(userBrightness);
      }
      display.clearDisplay();
    }
  }

  // 4. UI Display Handlers
  if (isDeviceLocked) {
    // 33 FPS render loop for smooth eye glide
    if (currentMillis - lastDisplayDraw >= 30) {
      lastDisplayDraw = currentMillis;
      drawEmoFace();
    }
  } else if (isClockModeActive) {
    if (currentMillis - lastDisplayDraw >= 500) {
      lastDisplayDraw = currentMillis;
      drawClockUI();
    }
  }

  // 5. Active & Background Logic Execution
  switch (currentMode) {
    case MODE_RADAR: {
      if (currentMillis - lastChannelHop >= 180) {
        lastChannelHop = currentMillis;
        currentChannel++;
        if (currentChannel > 13) currentChannel = 1;
        wifi_set_channel(currentChannel);
      }

